<p>Alumno: a.v.a.</p>

<p>Forma de titulaci&oacute;n propuesta: Titulaci&oacute;n por trabajo profesional.</p>

<p>Tutor: Erick Pulido</p>

<p>Instituci&oacute;n de origen: Servicios T&eacute;cnicos de Cobranza S.A. de C.V. (SERTEC)</p>

<p>Cargo designado: Desarrollador Junior.</p>

<p>Justificaci&oacute;n.</p>

<p>En el negocio de recuperaci&oacute;n de cartera, m&aacute;s precisamente, en la distribuci&oacute;n y manejo de informaci&oacute;n, el uso de tecnolog&iacute;a y an&aacute;lisis de informaci&oacute;n es una parte elemental en el aspecto de eficiencia y transparencia para garantizar un buen uso de los recursos. En la empresa SERTEC, se tiene un gran potencial en la optimizaci&oacute;n de m&uacute;ltiples servicios que son esenciales para el ejercicio de la cobranza, esto pues preserva los principios ETL de una manera consistente y distribuida, sin embargo, con el paso del tiempo, el cambio del personal, esquemas de trabajo, flujo de informaci&oacute;n y nuevas tecnolog&iacute;as, esto en un periodo considerable de tiempo, puede afectar estos principios de transparencia y eficiencia, para ello se tiene el personal de desarrollo, pues este se encuentra designado para analizar, optimizar y ofrecer nuevas propuestas que hagan una migraci&oacute;n de tecnolog&iacute;a segura y eficiente.</p>

<p>En mi a&ntilde;o y medio de experiencia laboral y como mi primer empleo en el &aacute;mbito profesional que va ligado a mi carrera, mis tareas designadas como desarrollador Junior o tambi&eacute;n especialista en TI Junior formalmente, han recurrido en estos &uacute;ltimos &aacute;mbitos, iniciando con la migraci&oacute;n de m&uacute;ltiples procesos ETL para distribuir informaci&oacute;n llegada de un cliente de la empresa, hacia m&uacute;ltiples &aacute;reas de TI para desarrollar sus tareas en un formato designado, preservando sus reglas de negocio y control de usuarios, esto mediante la implementaci&oacute;n de una aplicaci&oacute;n web con conexi&oacute;n a bases de datos.</p>

<p>Posteriormente, a&ntilde;adido a esto se solicitaron aplicaciones para un control de subida, actualizaci&oacute;n y extracci&oacute;n de informaci&oacute;n por parte del &aacute;rea operativa que realiza la cobranza directamente, esto siendo una agenda para m&uacute;ltiples usuarios donde sus supervisores y gerentes puedan guardar un mayor control en sus asesores de cobranza sobre sus registros. Finalmente, con un cambio de &aacute;rea dentro de TI, se me cambiar&iacute;a al desarrollo para el &aacute;rea de procesos de TI, la cual se encarga de una distribuci&oacute;n m&aacute;s inmediata de la informaci&oacute;n contenida en la base de datos productiva, haciendo uso nuevamente de una tecnolog&iacute;a descontinuada, ofreciendo la migraci&oacute;n de esta gesti&oacute;n de procesos a una aplicaci&oacute;n web y carga previa de insumos para dichos procesos a fin de aminorar la consulta a la base en horario laboral, donde los usuarios tendr&iacute;an un control de los procesos a ejecutar, modificar en su flujo por parte del mismo usuario sin requerir un an&aacute;lisis de c&oacute;digo m&aacute;s que el suficiente, y validar la entrega de insumos mediante un sistema de bit&aacute;cora e historial de procesos m&aacute;s inmediato.</p>

<p>Estas soluciones y an&aacute;lisis son posibles por el conocimiento aplicado que se fue adquirido en la carrera de Ciencias de la Computaci&oacute;n, donde los principios de bases de datos, an&aacute;lisis de algoritmos e ingenier&iacute;a de software ser&iacute;an de uso indispensable principalmente. Adem&aacute;s de ofrecer un amplio margen de experiencia en el &aacute;rea de TI respecto a los m&uacute;ltiples procesos y aplicaciones en las que se ha formado parte de su desarrollo, llegando a diferentes &aacute;mbitos y &aacute;reas que la misma carrera ofrece en el campo laboral.</p>

<p>Descripci&oacute;n del trabajo.</p>

<p>En el desempe&ntilde;o de actividades como desarrollador Junior, se hace un an&aacute;lisis de c&oacute;digo, implementaci&oacute;n de soluciones a m&uacute;ltiples funcionalidades requeridas y documentaci&oacute;n de la misma para garantizar su transparencia. Esto formar&iacute;a parte de las siguientes actividades enlistadas que se fueron asignadas y cubrir&iacute;a en un periodo de tiempo hasta su finalizaci&oacute;n o por mi cambio de &aacute;rea en TI por una reestructuraci&oacute;n interna.</p>

<p>Desarrollo en la migraci&oacute;n de procesos ETL con tecnolog&iacute;as actualmente descontinuadas hacia un sistema distribuido mediante uso de aplicaciones web destinadas para el uso de la empresa, preservando reglas de negocio y optimizando el flujo de los procesos creados previamente (periodo: 10 meses).</p>

<p>Implementaci&oacute;n de aplicaciones para uso cotidiano tipo agenda mediante operaciones CRUD, guardando un control de distintos tipos de usuarios y sus controles determinados para cada uno (periodo: 2 meses).</p>

<p>Implementaci&oacute;n y desarrollo de aplicaci&oacute;n de mensajer&iacute;a para el &aacute;rea de TI, designada para facilitar la comunicaci&oacute;n y acceso a informaci&oacute;n cotidiana, inmediata y temporal, ofreciendo las funcionalidades b&aacute;sicas de env&iacute;o y recepci&oacute;n de mensajes (periodo: 3 meses).</p>

<p>Implementaci&oacute;n y desarrollo de un sistema para control y ejecuci&oacute;n de procesos por parte del &aacute;rea de TI para el env&iacute;o de diferentes insumos para procesos adicionales o env&iacute;o de reporter&iacute;a por diferentes medios preestablecidos (FTP, correo electr&oacute;nico y unidades de red) (periodo 3 meses).</p>

<p>&Iacute;ndice tentativo del trabajo.</p>

<p>Introducci&oacute;n Cap&iacute;tulo 1. Desarrollo en &aacute;rea de Cyber - asignaciones Procesos de asignaciones. Proyecto web para Cyber y reestructuraci&oacute;n. Desarrollo y participaci&oacute;n en el proyecto. Cap&iacute;tulo 2. Plataforma adicional para &aacute;rea operativa (DTI) Descripci&oacute;n de aplicaci&oacute;n. Necesidades y participaci&oacute;n en proyecto. Aplicaciones adicionales y un proyecto independiente. Cap&iacute;tulo 3. Gesti&oacute;n de procesos An&aacute;lisis del &aacute;rea y estructura del &aacute;rea Cyber. Propuesta y participaci&oacute;n en nueva aplicaci&oacute;n. An&aacute;lisis y retrospectiva del proyecto. Conclusiones</p>

<p>Referencias bibliogr&aacute;ficas.</p>

<p>Firma del alumno.</p>

<p>Firma del tutor.</p>